/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_error.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vfearles <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/18 17:44:00 by vfearles          #+#    #+#             */
/*   Updated: 2020/01/12 13:25:48 by vfearles         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Печать ошибок и выход из программы через заданный номер
*/

void	ft_print_error(int id)
{
	write(2, "ERROR\n", 6);
	exit(id);
}
