/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_flags_lemin.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: asmall <asmall@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/14 21:58:17 by vfearles          #+#    #+#             */
/*   Updated: 2020/05/13 19:33:59 by asmall           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "lemin.h"

/*
** Печать ошибок и выход из программы через заданный номер
*/

void	ft_print_error(int id)
{
	write(2, "ERROR\n", 6);
	exit(id);
}

void	ft_perror(void)
{
	perror("lem-in");
	exit(1);
}
